app/controllers/vehicles_controller.rb

SELECT "vehicles".* FROM "vehicles" ORDER BY "vehicles"."created_at" ASC
---
  def index
    @vehicles = Vehicle.all.order(:created_at)

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @vehicle = Vehicle.find(params[:id])

INSERT INTO "vehicles" ("brand", "model", "year", "created_at", "updated_at", "kind", "plate") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["brand", nil], ["model", nil], ["year", nil], ["created_at", "2024-07-09 19:35:48.809587"], ["updated_at", "2024-07-09 19:35:48.809587"], ["kind", nil], ["plate", nil]]
---
  def create
    @vehicle = Vehicle.new(vehicle_params)
    if @vehicle.save

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def edit
    @vehicle = Vehicle.find(params[:id])

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def destroy
    @vehicle = Vehicle.find(params[:id])

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "vehicles" SET "brand" = $1, "updated_at" = $2 WHERE "vehicles"."id" = $3  [["brand", "teste21 para upd02"], ["updated_at", "2024-11-05 17:26:40.753710"], ["id", 11]]
---
  def update
    @vehicle = Vehicle.find(params[:id])
    if @vehicle.update(vehicle_params)