app/controllers/vehicles_controller.rb

  def index
    @vehicles = Vehicle.all.oder
---
SELECT "vehicles".* FROM "vehicles"